# Table of Contents
    ## Methods for combining data
    ## Merging your data
    ## Exporting data in pickle format

# Set Up Notebook

In [1]:
#Import libraries
import pandas as pd
import numpy as np
import os

In [4]:
#Define dictionary for Jan 2020
data = {'customer_id':['6732', '767', '890', '635'],
       'month':['Jan-20', 'Jan-20', 'Jan-20', 'Jan-20'],
       'purchased_meat':[0, 13, 3, 4],
       'purchased_alcohol':[1, 2, 10, 0],
       'purchased_snacks':[10, 5, 1, 7]}

In [3]:
#Define dictionary for Feb 2020
data2 = {'customer_id':['6732', '767', '890', '635'],
        'month':['Feb-20', 'Feb-20', 'Feb-20', 'Feb-20'],
        'purchased_meat':[0, 10, 5, 3],
        'purchased_alcohol':[2, 4, 14, 0],
        'purchased_snacks':[10, 5, 1, 7]}

In [5]:
#Turn dictionary to dataframe
df = pd.DataFrame(data, index=[0, 1, 2, 3])
df_1 = pd.DataFrame(data2, index=[0, 1, 2, 3])

In [6]:
df

  customer_id   month  purchased_meat  purchased_alcohol  purchased_snacks
0        6732  Jan-20               0                  1                10
1         767  Jan-20              13                  2                 5
2         890  Jan-20               3                 10                 1
3         635  Jan-20               4                  0                 7

In [7]:
df_1

  customer_id   month  purchased_meat  purchased_alcohol  purchased_snacks
0        6732  Feb-20               0                  2                10
1         767  Feb-20              10                  4                 5
2         890  Feb-20               5                 14                 1
3         635  Feb-20               3                  0                 7

# Combining Data

## Concatenating Data

In [9]:
#Concatenate Dataframes
frames = [df, df_1]
df_concat = pd.concat(frames)
df_concat

  customer_id   month  purchased_meat  purchased_alcohol  purchased_snacks
0        6732  Jan-20               0                  1                10
1         767  Jan-20              13                  2                 5
2         890  Jan-20               3                 10                 1
3         635  Jan-20               4                  0                 7
0        6732  Feb-20               0                  2                10
1         767  Feb-20              10                  4                 5
2         890  Feb-20               5                 14                 1
3         635  Feb-20               3                  0                 7

## Appending Data

In [10]:
df_appended = df.append(df_1)

In [11]:
df_appended

  customer_id   month  purchased_meat  purchased_alcohol  purchased_snacks
0        6732  Jan-20               0                  1                10
1         767  Jan-20              13                  2                 5
2         890  Jan-20               3                 10                 1
3         635  Jan-20               4                  0                 7
0        6732  Feb-20               0                  2                10
1         767  Feb-20              10                  4                 5
2         890  Feb-20               5                 14                 1
3         635  Feb-20               3                  0                 7

## Merging Data

In [12]:
#create different size dataframe
data3 = {'customer_id':['6732', '767', '890', '635'],
    'month':['Jan-20', 'Jan-20', 'Jan-20', 'Jan-20'],
    'days_purchased_on':[0, 13, 3, 4]}
df_2 = pd.DataFrame(data3,index=[0, 1, 2, 3])

In [13]:
#merge column
df_merged = df.merge(df_2, on = 'customer_id')
df_merged

,customer_id,month_x,purchased_meat,purchased_alcohol,purchased_snacks,month_y,days_purchased_on
0,6732,Jan-20,0,1,10,Jan-20,0
1,767,Jan-20,13,2,5,Jan-20,13
2,890,Jan-20,3,10,1,Jan-20,3
3,635,Jan-20,4,0,7,Jan-20,4

In [14]:
df_merged = df.merge(df_2, on = ['customer_id', 'month'], indicator = True)
df_merged

,customer_id,month,purchased_meat,purchased_alcohol,purchased_snacks,days_purchased_on,_merge
0,6732,Jan-20,0,1,10,0,both
1,767,Jan-20,13,2,5,13,both
2,890,Jan-20,3,10,1,3,both
3,635,Jan-20,4,0,7,4,both

In [15]:
df_merged['_merge'].value_counts()

both          4
left_only     0
right_only    0
Name: _merge, dtype: int64

## Merging Instacart Data

In [17]:
# import new dataset
path = r'C:\Users\mmreg\OneDrive\Desktop\Data Analytics Course Work\Data Immersion\Tasks\04-2022 Instacart Basket Analysis'
df_ords_prior = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'IC Order Product Prior.csv'), index_col = False)

In [18]:
# check dimension
df_ords_prior.shape

(32434489, 4)

In [25]:
# merge order and order prior dataframes
df_ords = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'IC Orders.csv'))

In [27]:
df_merged_large = df_ords.merge(df_ords_prior, on = 'order_id', indicator = True)

## Export Large Dataframe as Pkl file

In [28]:
df_merged_large.to_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'Merged Orders Data.pkl'))